# Dataset Descriptions
This notebook contains most of the datasets used in Pandas Cookbook along with the names, types, descriptions and some summary statistics of each column. This is not an exhaustive list as several datasets used in the book are quite small and are explained with enough detail in the book itself. The datasets presented here are the prominent ones that appear most frequently throughout the book.

## Datasets in order of appearance
* [Movie](#Movie-Dataset)
* [College](#College-Dataset)
* [Employee](#Employee-Dataset)
* [Flights](#Flights-Dataset)
* [Chinook Database](#Chinook-Database)
* [Crime](#Crime-Dataset)
* [Meetup Groups](#Meetup-Groups-Dataset)
* [Diamonds](#Diamonds-Dataset)

In [1]:
import pandas as pd
pd.options.display.max_columns = 80

# Movie Dataset

### Brief Overview
28 columns from 4,916 movies scraped from the popular website IMDB. Each row contains information on a single movie dating back to 1916 to 2015. Actor and director facebook likes should be constant for all instances across all movies. For instance, Johnny Depp should have the same number of facebook likes regardless of which movie he is in. Since each movie was not scraped at the same exact time, there are some inconsistencies in these counts. The dataset **movie_altered.csv** is a much cleaner version of this dataset.

In [2]:
movie = pd.read_csv('data/movie.csv')
movie.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,actor_1_name,movie_title,num_voted_users,cast_total_facebook_likes,actor_3_name,facenumber_in_poster,plot_keywords,movie_imdb_link,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,CCH Pounder,Avatar,886204,4834,Wes Studi,0.0,avatar|future|marine|native|paraplegic,http://www.imdb.com/title/tt0499549/?ref_=fn_t...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,Johnny Depp,Pirates of the Caribbean: At World's End,471220,48350,Jack Davenport,0.0,goddess|marriage ceremony|marriage proposal|pi...,http://www.imdb.com/title/tt0449088/?ref_=fn_t...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,Christoph Waltz,Spectre,275868,11700,Stephanie Sigman,1.0,bomb|espionage|sequel|spy|terrorist,http://www.imdb.com/title/tt2379713/?ref_=fn_t...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,Tom Hardy,The Dark Knight Rises,1144337,106759,Joseph Gordon-Levitt,0.0,deception|imprisonment|lawlessness|police offi...,http://www.imdb.com/title/tt1345836/?ref_=fn_t...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,Doug Walker,Star Wars: Episode VII - The Force Awakens,8,143,NaN,0.0,NaN,http://www.imdb.com/title/tt5289954/?ref_=fn_t...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0

In [3]:
movie.shape

(4916, 28)

In [4]:
pd.read_csv('data/descriptions/movie_decsription.csv', index_col='Column Name')

,Data Type,Column Description,Missing Values,Mean,Most Common Value,Number of Unique Values
Column Name,,,,,,
color,object,Color or Black and White,19,NaN,Color,2
director_name,object,Director Name,102,NaN,Steven Spielberg,2397
num_critic_for_reviews,float64,Number of critical reviews,49,137.99,NaN,528
duration,float64,Length in minutes,15,107.09,NaN,191
director_facebook_likes,float64,Number of Facebook likes,102,691.01,NaN,435
actor_3_facebook_likes,float64,Number of Facebook likes,23,631.28,NaN,906
actor_2_name,object,Second most prominent actor name,13,NaN,Morgan Freeman,3030
actor_1_facebook_likes,float64,Number of Facebook likes,7,6494.49,NaN,877
gross,float64,Total amount of revenue earned,862,47644514.53,NaN,4033
genres,object,Pipe separated list of all genres in movie,0,NaN,Drama,914
actor_1_name,object,Most prominent actor name,7,NaN,Robert De Niro,2095
movie_title,object,Movie title,0,NaN,Die Hard with a Vengeance,4916
num_voted_users,int64,Number of users that scored movie,0,82644.92,NaN,4750
cast_total_facebook_likes,int64,All actor,0,9579.82,NaN,3960
actor_3_name,object,Third most prominent actor name,23,NaN,Steve Coogan,3519
facenumber_in_poster,float64,Number of faces in movie poster,13,1.38,NaN,19
plot_keywords,object,Pipe separated list of plot keywords,152,NaN,based on novel,4756
movie_imdb_link,object,URL of IMDB,0,NaN,http://www.imdb.com/title/tt0117333/?ref_=fn_t...,4916
num_user_for_reviews,float64,Number of user reviews,21,267.67,NaN,954
language,object,Language,12,NaN,English,47
country,object,Country,5,NaN,USA,65
content_rating,object,G/PG/PG-13/R,300,NaN,R,18
budget,float64,Budget in country currency,484,36547486.03,NaN,438
title_year,float64,Year movie was made 1916-2015,106,2002.45,NaN,91
actor_2_facebook_likes,float64,Number of Facebook likes,13,1621.92,NaN,917
imdb_score,float64,Score from users,0,6.44,NaN,78
aspect_ratio,float64,Proportion of width to height,326,2.22,NaN,22
movie_facebook_likes,int64,Number of Facebook likes for movie,0,7348.29,NaN,876

# College Dataset

### Brief Overview

US department of education data on 7,535 colleges. Only a sample of the total number of columns available were used in this dataset. Visit [the website](https://collegescorecard.ed.gov/data/) for more info. Data was pulled in January, 2017.

In [5]:
college = pd.read_csv('data/college.csv')
college.head()

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,UGDS,UGDS_WHITE,UGDS_BLACK,UGDS_HISP,UGDS_ASIAN,UGDS_AIAN,UGDS_NHPI,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,0.0333,0.9353,0.0055,0.0019,0.0024,0.0019,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,0.5922,0.2600,0.0283,0.0518,0.0022,0.0007,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,291.0,0.2990,0.4192,0.0069,0.0034,0.0000,0.0000,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
3,University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,5451.0,0.6988,0.1255,0.0382,0.0376,0.0143,0.0002,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
4,Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,4811.0,0.0158,0.9208,0.0121,0.0019,0.0010,0.0006,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [6]:
college.shape

(7535, 27)

In [7]:
pd.read_csv('data/descriptions/college_decsription.csv')

,Column Name,Data Type,Column Description,Missing Values,Mean,Most Common Value,Number of Unique Values
0,INSTNM,object,Institution Name,0,NaN,Connecticut Center for Massage Therapy-Westport,7535
1,CITY,object,City Location,0,NaN,New York,2514
2,STABBR,object,State Abbreviation,0,NaN,CA,59
3,HBCU,float64,Historically Black College or University,371,0.01,NaN,2
4,MENONLY,float64,0/1 Men Only,371,0.01,NaN,2
5,WOMENONLY,float64,0/1 Women only,371,0.01,NaN,2
6,RELAFFIL,int64,0/1 Religious Affiliation,0,0.19,NaN,2
7,SATVRMID,float64,SAT Verbal Median,6350,522.82,NaN,163
8,SATMTMID,float64,SAT Math Median,6339,530.77,NaN,167
9,DISTANCEONLY,float64,Distance Education Only,371,0.01,NaN,2
10,UGDS,float64,Undergraduate Enrollment,661,2356.84,NaN,2932
11,UGDS_WHITE,float64,Percent Undergrad White,661,0.51,NaN,4397
12,UGDS_BLACK,float64,Percent Undergrad Black,661,0.19,NaN,3242
13,UGDS_HISP,float64,Percent Undergrad Hispanic,661,0.16,NaN,2809
14,UGDS_ASIAN,float64,Percent Undergrad Asian,661,0.03,NaN,1254
15,UGDS_AIAN,float64,Percent Undergrad American Indian/Alaskan Native,661,0.01,NaN,601
16,UGDS_NHPI,float64,Percent Undergrad Native Hawaiian/Pacific Isla...,661,0.00,NaN,363
17,UGDS_2MOR,float64,Percent Undergrad 2 or more races,661,0.02,NaN,957
18,UGDS_NRA,float64,Percent Undergrad non-resident aliens,661,0.02,NaN,920
19,UGDS_UNKN,float64,Percent Undergrad race unknown,661,0.05,NaN,1517
20,PPTUG_EF,float64,Percent Students part-time,682,0.23,NaN,3420
21,CURROPER,int64,0/1 Currently Operating,0,0.92,NaN,2
22,PCTPELL,float64,Percent Students with Pell grant,686,0.53,NaN,4422
23,PCTFLOAN,float64,Percent Students with federal loan,686,0.52,NaN,4155
24,UG25ABV,float64,Percent Students Older than 25,817,0.41,NaN,4285
25,MD_EARN_WNE_P10,object,Median Earnings 10 years after enrollment,1122,NaN,PrivacySuppressed,598
26,GRAD_DEBT_MDN_SUPP,object,Median debt of completers,32,NaN,PrivacySuppressed,2038

# Employee Dataset

### Brief Overview
The city of Houston provides information on all its employees to the public. This is a random sample of 2,000 employees with a few of the more interesting columns. For more on [open Houston data visit their website](http://data.houstontx.gov/). Data was pulled in December, 2016.

In [8]:
employee = pd.read_csv('data/employee.csv')
employee.head()

,UNIQUE_ID,POSITION_TITLE,DEPARTMENT,BASE_SALARY,RACE,EMPLOYMENT_TYPE,GENDER,EMPLOYMENT_STATUS,HIRE_DATE,JOB_DATE
0,0,ASSISTANT DIRECTOR (EX LVL),Municipal Courts Department,121862.0,Hispanic/Latino,Full Time,Female,Active,2006-06-12,2012-10-13
1,1,LIBRARY ASSISTANT,Library,26125.0,Hispanic/Latino,Full Time,Female,Active,2000-07-19,2010-09-18
2,2,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Full Time,Male,Active,2015-02-03,2015-02-03
3,3,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Full Time,Male,Active,1982-02-08,1991-05-25
4,4,ELECTRICIAN,General Services Department,56347.0,White,Full Time,Male,Active,1989-06-19,1994-10-22

In [9]:
employee.shape

(2000, 10)

In [10]:
pd.read_csv('data/descriptions/employee_description.csv')

,Column Name,Data Type,Column Description,Missing Values,Mean,Most Common Value,Number of Unique Values
0,UNIQUE_ID,int64,Uniquely identifies each employeee,0,999.50,NaN,2000
1,POSITION_TITLE,object,Specific Position,0,NaN,SENIOR POLICE OFFICER,330
2,DEPARTMENT,object,Department,0,NaN,Houston Police Department-HPD,24
3,BASE_SALARY,float64,Base salary,114,55767.93,NaN,791
4,RACE,object,Race,35,NaN,Black or African American,6
5,EMPLOYMENT_TYPE,object,"Full Time/Part time/Temporary, etc...",0,NaN,Full Time,5
6,GENDER,object,Male/Female,0,NaN,Male,2
7,EMPLOYMENT_STATUS,object,Active or Inactive,0,NaN,Active,2
8,HIRE_DATE,object,Date Hired,0,NaN,2016-03-28,999
9,JOB_DATE,object,Date began latest position,3,NaN,2002-01-05,947

# Flights Dataset

### Brief Overview
A random sample of three percent of the US domestic flights originating from the ten busiest airports. Data is from the U.S. Department of Transportation's (DOT) Bureau of Transportation Statistics. [See here for more info](https://www.kaggle.com/usdot/flight-delays).

In [11]:
flights = pd.read_csv('data/flights.csv')
flights.head()

,MONTH,DAY,WEEKDAY,AIRLINE,ORG_AIR,DEST_AIR,SCHED_DEP,DEP_DELAY,AIR_TIME,DIST,SCHED_ARR,ARR_DELAY,DIVERTED,CANCELLED
0,1,1,4,WN,LAX,SLC,1625,58.0,94.0,590,1905,65.0,0,0
1,1,1,4,UA,DEN,IAD,823,7.0,154.0,1452,1333,-13.0,0,0
2,1,1,4,MQ,DFW,VPS,1305,36.0,85.0,641,1453,35.0,0,0
3,1,1,4,AA,DFW,DCA,1555,7.0,126.0,1192,1935,-7.0,0,0
4,1,1,4,WN,LAX,MCI,1720,48.0,166.0,1363,2225,39.0,0,0

In [12]:
flights.shape

(58492, 14)

In [13]:
pd.read_csv('data/descriptions/flights_description.csv')

,Column Name,Data Type,Column Description,Missing Values,Mean,Most Common Value,Number of Unique Values
0,MONTH,int64,Month (1-12),0,6.22,NaN,11
1,DAY,int64,Day of the month,0,15.70,NaN,31
2,WEEKDAY,int64,Weekday 1 (Monday) - 7 (Sunday),0,3.93,NaN,7
3,AIRLINE,object,One of 14 major air carriers,0,NaN,DL,14
4,ORG_AIR,object,Origin aiport code,0,NaN,ATL,10
5,DEST_AIR,object,Destination airport code,0,NaN,LAX,271
6,SCHED_DEP,int64,Scheduled department time,0,1387.98,NaN,1162
7,DEP_DELAY,float64,Minutes delayed past scheduled departure time,833,10.92,NaN,389
8,AIR_TIME,float64,Minutes in air,1018,115.93,NaN,453
9,DIST,int64,Flight distance in miles,0,872.90,NaN,850
10,SCHED_ARR,int64,Scheduled arrival time,0,1549.40,NaN,1295
11,ARR_DELAY,float64,Minutes delayed past scheduled arrival time,1018,5.81,NaN,420
12,DIVERTED,int64,Is the flight diverted (0/1),0,0.00,NaN,2
13,CANCELLED,int64,Is the flight cancelled? (0/1),0,0.02,NaN,2

### Airline Codes

In [14]:
pd.read_csv('data/descriptions/airlines.csv')

   IATA_CODE                       AIRLINE
0         UA         United Air Lines Inc.
1         AA        American Airlines Inc.
2         US               US Airways Inc.
3         F9        Frontier Airlines Inc.
4         B6               JetBlue Airways
5         OO         Skywest Airlines Inc.
6         AS          Alaska Airlines Inc.
7         NK              Spirit Air Lines
8         WN        Southwest Airlines Co.
9         DL          Delta Air Lines Inc.
10        EV   Atlantic Southeast Airlines
11        HA        Hawaiian Airlines Inc.
12        MQ  American Eagle Airlines Inc.
13        VX                Virgin America

### Airport codes

In [15]:
pd.read_csv('data/descriptions/airports.csv').head()

,IATA_CODE,AIRPORT,CITY,STATE,COUNTRY,LATITUDE,LONGITUDE
0,ABE,Lehigh Valley International Airport,Allentown,PA,USA,40.65236,-75.44040
1,ABI,Abilene Regional Airport,Abilene,TX,USA,32.41132,-99.68190
2,ABQ,Albuquerque International Sunport,Albuquerque,NM,USA,35.04022,-106.60919
3,ABR,Aberdeen Regional Airport,Aberdeen,SD,USA,45.44906,-98.42183
4,ABY,Southwest Georgia Regional Airport,Albany,GA,USA,31.53552,-84.19447

# Chinook Database

### Brief Overview
This is a sample database of a music store provided by SQLite with 11 tables. The table description image is an excellent way to get familiar with the database. [Visit the sqlite website](http://www.sqlitetutorial.net/sqlite-sample-database/) for more detail.
![data/descriptions/data/descriptions/ch09_05_erd.png](data/descriptions/ch09_05_erd.png)

# Crime Dataset

### Brief Overview
All crime and traffic accidents for the city of Denver from January to September of 2017. This dataset is stored in special binary form called *hdf5*. Pandas uses the PyTables library to help read the data into a DataFrame. [Read the documentation](http://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5) for more info on hdf5 formatted data.

In [16]:
crime = pd.read_hdf('data/crime.h5')
crime.head()

,OFFENSE_TYPE_ID,OFFENSE_CATEGORY_ID,REPORTED_DATE,GEO_LON,GEO_LAT,NEIGHBORHOOD_ID,IS_CRIME,IS_TRAFFIC
0,traffic-accident-dui-duid,traffic-accident,2014-06-29 02:01:00,-105.000149,39.745753,cbd,0,1
1,vehicular-eluding-no-chase,all-other-crimes,2014-06-29 01:54:00,-104.884660,39.738702,east-colfax,1,0
2,disturbing-the-peace,public-disorder,2014-06-29 02:00:00,-105.020719,39.706674,athmar-park,1,0
3,curfew,public-disorder,2014-06-29 02:18:00,-105.001552,39.769505,sunnyside,1,0
4,aggravated-assault,aggravated-assault,2014-06-29 04:17:00,-105.018557,39.679229,college-view-south-platte,1,0

In [17]:
crime.shape

(460911, 8)

In [18]:
pd.read_csv('data/descriptions/crime_description.csv')

,Column Name,Data Type,Column Description,Missing Values,Mean,Number of Unique Values
0,OFFENSE_TYPE_ID,category,Offenes Type,0,NaN,196
1,OFFENSE_CATEGORY_ID,category,Offense Category Name,0,NaN,15
2,REPORTED_DATE,datetime64[ns],Reported Date,0,NaN,390969
3,GEO_LON,float64,Longitude,3615,-104.95,89196
4,GEO_LAT,float64,Latitude,3615,39.73,89012
5,NEIGHBORHOOD_ID,category,Neighborhood Name,0,NaN,78
6,IS_CRIME,int64,Is it a crime? (0/1),0,0.73,2
7,IS_TRAFFIC,int64,Is it a traffic accident (0/1),0,0.27,2

# Meetup Groups Dataset

### Brief Overview
Data was collected through the [meetup.com API](https://www.meetup.com/meetup_api/) on five Houston-area data science meetup groups. Each row represents a member joining a particular group.

In [19]:
meetup = pd.read_csv('data/meetup_groups.csv')
meetup.head()

             join_date                     group     city state country
0  2016-11-18 02:41:29  houston machine learning  Houston    TX      us
1  2017-05-09 14:16:37  houston machine learning  Houston    TX      us
2  2016-12-30 02:34:16  houston machine learning  Houston    TX      us
3  2016-07-18 00:48:17  houston machine learning  Houston    TX      us
4  2017-05-25 12:58:16  houston machine learning  Houston    TX      us

In [20]:
meetup.shape

(7671, 5)

In [21]:
pd.read_csv('data/descriptions/meetup_description.csv')

,Column Name,Data Type,Column Description,Missing Values,Mean,Most Common Value,Number of Unique Values
0,join_date,object,Date Joined,0,NaN,2016-07-10 16:33:53,7631
1,group,object,Group Name,0,NaN,houston data science,5
2,city,object,City,0,NaN,Houston,316
3,state,object,State,144,NaN,TX,46
4,country,object,Country,0,NaN,us,43

# Diamonds Dataset

### Brief Overview
Quality, size and price of nearly 54,000 diamonds scraped from the [Diamond Search Engine](http://www.diamondse.info/) by Hadley Wickham. [Visit blue nile](https://www.bluenile.com/ca/education/diamonds?track=SideNav) for a beginners guide to diamonds.

In [22]:
diamonds = pd.read_csv('data/diamonds.csv')
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [23]:
diamonds.shape

(53940, 10)

In [24]:
pd.read_csv('data/descriptions/diamonds_description.csv')

,Column Name,Data Type,Column Description,Missing Values,Mean,Most Common Value,Number of Unique Values
0,carat,float64,Size of diamond in carats,0,0.80,NaN,273
1,cut,object,"Quality of the cut (Fair, Good, Very Good, Pre...",0,NaN,Ideal,5
2,color,object,Color ranging from worst to best - J through D,0,NaN,G,7
3,clarity,object,Measurement of imperfections ranging from wors...,0,NaN,SI1,8
4,depth,float64,"Total depth percentage = z / mean(x, y) = 2 * ...",0,61.75,NaN,184
5,table,float64,Qidth of top of diamond relative to widest point,0,57.46,NaN,127
6,price,int64,Price,0,3932.80,NaN,11602
7,x,float64,Length in mm,0,5.73,NaN,554
8,y,float64,Width in mm,0,5.73,NaN,552
9,z,float64,Depth in mm,0,3.54,NaN,375